In [ ]:
===================== EDA  packages======================

1) pandas: data frame application(how to read write or modify the data)
2) Numpy: numerical python all math application
3) matplotlip: used for plottin
4) Seaborn: used for plot
5) Plotly:used for plot
6) Bokhe:plot
# first four are mainly important


=======================Machine learning==============
7)sickit-learn:sklear 

======================Deep learning=================
8)Tensorflow: Google
9) keras: Google
10) pytorch :Facebook
====================NLP==============
11) NLTK: natural language tool kit
12) Scipy
===================BERT==============
13) Transformers: hugging face (Google)
==================Google models ==================
14)Specific google packages 
================ Azure ML======================
15) Azure packages 
=================GenAI========================
16)Gemiani:Google 
17) ChatGPT:Openai
==================LangChain==================
18)LangChain packages

**Create a dataframe using list**

- list==dict
- dict=== list

$step 1$ create a dataframe

In [1]:
import pandas as pd
names=['Ayush','Avinash','Akash']
pd.DataFrame()#empty dataframe no rows and no columns

Empty DataFrame
Columns: []
Index: []

 $step 2$ : provide the data

In [2]:
pd.DataFrame(names)# it will print

         0
0    Ayush
1  Avinash
2    Akash

In [4]:
age=[21, 23, 15]
pd.DataFrame(names,age)
# the first positional argument is data
# second positional argument is index 
# so here age became index not data ass it is second positional
# so now zip it and make it  1st positional data

          0
21    Ayush
23  Avinash
15    Akash

In [5]:
age=[21, 23, 15]
pd.DataFrame(zip(names,age))
# so now both age and name are at first positional argument 
# now it is printed as data not index

         0   1
0    Ayush  21
1  Avinash  23
2    Akash  15

In [7]:
salary=[1000000, 450000,2000]
pd.DataFrame(zip(names,age,salary))

         0   1        2
0    Ayush  21  1000000
1  Avinash  23   450000
2    Akash  15     2000

In [8]:
names=['Ayush','Avinash','Akash']
age=[21, 23, 15]
salary=[1000000, 450000,2000]# 
city=['hyd','blr','mumbai']# if you wat city as index
pd.DataFrame(zip(names,age,salary), city)

              0   1        2
hyd       Ayush  21  1000000
blr     Avinash  23   450000
mumbai    Akash  15     2000

In [9]:
names=['Ayush','Avinash','Akash']
age=[21, 23, 15]
salary=[1000000, 450000,2000]# 
city=['hyd','blr','mumbai']# if you wat city as index
data=zip(names,age,salary)
pd.DataFrame(data, city)

              0   1        2
hyd       Ayush  21  1000000
blr     Avinash  23   450000
mumbai    Akash  15     2000

**provide columns names**

In [14]:
names=['Ayush','Avinash','Akash']
age=[21, 23, 15]
salary=[1000000, 450000,2000]# as data
city=['hyd','blr','mumbai']
pd.DataFrame(zip(names,age,salary,city),['Names','Age','Salary','City'] )
#column is third positional argument
# if you provide it on second place it will print as index
# if you want to prin as column's name provide it with column= blah blah bal
# the upper code will  show error as index is 3 but we given 4 thing at index position

ValueError: Length of values (3) does not match length of index (4)

In [15]:
names=['Ayush','Avinash','Akash']
age=[21, 23, 15]
salary=[1000000, 450000,2000]# as data
city=['hyd','blr','mumbai']
pd.DataFrame(zip(names,age,salary,city),['Names','Age','Salary',] )
# as we gave 3 thing at index postion it printed 
# but not as column

              0   1        2       3
Names     Ayush  21  1000000     hyd
Age     Avinash  23   450000     blr
Salary    Akash  15     2000  mumbai

In [16]:
names=['Ayush','Avinash','Akash']
age=[21, 23, 15]
salary=[1000000, 450000,2000]# as data
city=['hyd','blr','mumbai']
pd.DataFrame(zip(names,age,salary,city), columns=['Names','Age','Salary','City'] )
# now it is printed as columns

     Names  Age   Salary    City
0    Ayush   21  1000000     hyd
1  Avinash   23   450000     blr
2    Akash   15     2000  mumbai

In [17]:
names=['Ayush','Avinash','Akash']
age=[21, 23, 15]
salary=[1000000, 450000,2000]# as data
city=['hyd','blr','mumbai']
data=zip(names,age,salary,city)
cols=['Names','Age','Salary','City']
pd.DataFrame(data, columns=cols)
# now it is printed as columns

     Names  Age   Salary    City
0    Ayush   21  1000000     hyd
1  Avinash   23   450000     blr
2    Akash   15     2000  mumbai

In [18]:
# now save the data
names=['Ayush','Avinash','Akash']
age=[21, 23, 15]
salary=[1000000, 450000,2000]# as data
city=['hyd','blr','mumbai']
data=zip(names,age,salary,city)
cols=['Names','Age','Salary','City']
df=pd.DataFrame(data, columns=cols)
type(df)

pandas.core.frame.DataFrame

$step 4$
**add a new coloumn**
- if you want to add a new column
- you need to check no,of rows already existed data
- for ex-  i above data frame there are3 rows
- create a new list with 3 rows
- that list equate to the dataframe

In [20]:
job=['DS','DE','CS']
df['Job']=job# given one more column job
df# this is call adding

     Names  Age   Salary    City Job
0    Ayush   21  1000000     hyd  DS
1  Avinash   23   450000     blr  DE
2    Akash   15     2000  mumbai  CS

$step5$
**Update the  already existing column**

-  create anew coloumn and updating the new column has same way

In [21]:
# i want to change  the age 
df['Age']=[45,24,34]
df# old age is replaced by new age

     Names  Age   Salary    City Job
0    Ayush   45  1000000     hyd  DS
1  Avinash   24   450000     blr  DE
2    Akash   34     2000  mumbai  CS

$step6$
**change the index**

In [24]:
names=['Ayush','Avinash','Akash']
age=[21, 23, 15]
salary=[1000000, 450000,2000]# as data
city=['hyd','blr','mumbai']
data=zip(names,age,salary,city)
cols=['Names','Age','Salary','City']
idx=['A','B','C']
df=pd.DataFrame(data,index=idx, columns=cols)
df #remember the no. of rows ==== len of list
# no.of list ==== no.of columns

     Names  Age   Salary    City
A    Ayush   21  1000000     hyd
B  Avinash   23   450000     blr
C    Akash   15     2000  mumbai

In [29]:
names=['Ayush','Avinash','Akash','Anvi']# now if we increase the values of list rows also increase
age=[21, 23, 15,35]
salary=[1000000, 450000,2000,49990]# as data
city=['hyd','blr','mumbai','chennai']
data=zip(names,age,salary,city)
cols=['Names','Age','Salary','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx, columns=cols)
df

     Names  Age   Salary     City
A    Ayush   21  1000000      hyd
B  Avinash   23   450000      blr
C    Akash   15     2000   mumbai
D     Anvi   35    49990  chennai

- no.of list equals to *number of columns*
- no.of value inside the list equals to *number of rows*
- when you create the dta all the lists will be in same length

$step 7$
**shape**
- no .of colums
- no.of rows

In [32]:
df.shape
# matrix format
# 4 rows 4 columns
print('the number of rows are:',df.shape[0] )
print('the number of columns are:',df.shape[1] )

the number of rows are: 4
the number of columns are: 4

$step8$
**drop the colunmn**
- in order to drop the column we requride 3 arguments
 -names
   - the column name we need to mention
- axis 
  - axis=0 **represts rows**
  - axis=1 **represts columns**# imp interview 
- inplace
    - we are drop column means we are modifying the dataframe
    - so this modifications we  want to save in same variable or different variable
    - if you want to keep in the asme variable **inplace=True**

In [ ]:
df.drop('City',axis=1,inplace=True)

In [40]:
df

     Names  Age   Salary
A    Ayush   21  1000000
B  Avinash   23   450000
C    Akash   15     2000
D     Anvi   35    49990

In [45]:
df.drop('Age',
        axis=1)

     Names   Salary
A    Ayush  1000000
B  Avinash   450000
C    Akash     2000
D     Anvi    49990

In [48]:
df# in above we already drop age but here df is print age 
# because inplace is not give above so the drop isnot save in same variable now we have to saveit
df1=df.drop('Age',
        axis=1)
# now df is name age and salary 
# but df1 is name and salary # stored in different variable
df1

     Names   Salary
A    Ayush  1000000
B  Avinash   450000
C    Akash     2000
D     Anvi    49990

In [49]:
names=['Ayush','Avinash','Akash','Anvi']#pracice 
age=[21, 23, 15,35]
salary=[1000000, 450000,2000,49990]# as data
city=['hyd','blr','mumbai','chennai']
data=zip(names,age,salary,city)
cols=['Names','Age','Salary','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx, columns=cols)
df

     Names  Age   Salary     City
A    Ayush   21  1000000      hyd
B  Avinash   23   450000      blr
C    Akash   15     2000   mumbai
D     Anvi   35    49990  chennai

In [50]:
df.drop('City',
       axis=1,
       inplace=True)
df# with in place

     Names  Age   Salary
A    Ayush   21  1000000
B  Avinash   23   450000
C    Akash   15     2000
D     Anvi   35    49990

In [56]:
df1=df.drop('Age',
           axis=1,)# without in place
print(df1)

     Names   Salary
A    Ayush  1000000
B  Avinash   450000
C    Akash     2000
D     Anvi    49990

In [57]:
df

     Names  Age   Salary
A    Ayush   21  1000000
B  Avinash   23   450000
C    Akash   15     2000
D     Anvi   35    49990

$step 9$
**Multiple columns**

In [61]:

names=['Ayush','Avinash','Akash','Anvi']#pracice 
age=[21, 23, 15,35]
salary=[1000000, 450000,2000,49990]# as data
city=['hyd','blr','mumbai','chennai']
data=zip(names,age,salary,city)
cols=['Names','Age','Salary','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx, columns=cols)
df
# when you see multiple column remember list will there
df.drop(['Age','City'],axis=1,inplace=True)
df

     Names   Salary
A    Ayush  1000000
B  Avinash   450000
C    Akash     2000
D     Anvi    49990

In [62]:
df.drop(['Age','City'],axis=0,inplace=True)# if we give 0 instead of 1 in axis 
# error as age annd city is give put

KeyError: "['Age', 'City'] not found in axis"

$stop 10$
**Drop the rows**

In [64]:
names=['Ayush','Avinash','Akash','Anvi']#pracice 
age=[21, 23, 15,35]
salary=[1000000, 450000,2000,49990]# as data
city=['hyd','blr','mumbai','chennai']
data=zip(names,age,salary,city)
cols=['Names','Age','Salary','City']
idx=['A','B','C','D']
df=pd.DataFrame(data,index=idx, columns=cols)
df.drop(['A','B'],axis=0,inplace=True)
df# look row a and b are gone

   Names  Age  Salary     City
C  Akash   15    2000   mumbai
D   Anvi   35   49990  chennai

$step 11$
**how to save the data frame**

- Generally  data frames are two types
- csv (comma seperated value)
- excel

In [73]:
# first save in csv
# if you want to save in same plac where your python is
# or if another give all the directory where you want to save 
# here i am saving where python file is 
 #only giving
# file name=data_file
# and extension=csv

df.to_csv('data_file.csv')# so when we saw it on microsof excel# one extra row is coming for
# names age and all thing
df.to_csv('data_file1.csv',index=False)# do index == false# now index is not coming the extea one

In [74]:
df.to_excel('data_file2.xlsx',index=False)#extension xlsx
# excel sheet have more kb thatswhs csv should use not excel sheet